Tekla.Structures.Datatype.IDataType
The IDataType interface is the root interface for converting all the
Tekla.Structures.Datatype.* types to basic types supported by the
Tekla Structures Object Dialog tree.